cf/Documents/КоммерческоеПредложение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>КоммерческоеПредложение</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидятВсе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатьСНаличием</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПересчитыватьЦену</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Артикул</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураКартинки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Производитель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Производители</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пересчет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентАвтоматическойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРучнойСкидки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАвтоматическойСкидки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наличие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Акция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Акция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезСкидки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Documents/КоммерческоеПредложение/Forms/ЗагрузкаИзТаблицы/Ext/Form/Module.bsl
&НаСервере
Функция НайтиТоварыИПоложитьВХранилище()
	
	// Ищем по артикулу
	
	//Запрос = Новый Запрос("
	//|ВЫБРАТЬ Тов.Артикул, Тов.Номенклатура, Тов.Цена, Тов.Количество, Тов.ПроизводительКод, Тов.Комментарий
	//|ПОМЕСТИТЬ Товары
	//|ИЗ &Товары КАК Тов;
	//
	//|ВЫБРАТЬ Тов.Артикул, ЕСТЬNULL(Спр.Ссылка, Тов.Номенклатура) Номенклатура, Тов.Цена, Тов.Количество, Истина Пересчет, Произ.Ссылка Производитель, Тов.Комментарий
	//|ИЗ Товары КАК Тов
	//
	//|ЛЕВОЕ СОЕДИНЕНИЕ
	//|	(	ВЫБРАТЬ Артикул, МАКСИМУМ(Ссылка)
	//|		ИЗ 		Справочник.Номенклатура 
	//|		ГДЕ НЕ ПометкаУдаления И Артикул В(ВЫБРАТЬ Артикул ИЗ Товары)
	//|		СГРУППИРОВАТЬ ПО Артикул
	//|	) Спр
	//|ПО 
	//|	Спр.Артикул = Тов.Артикул
	//|
	//|ЛЕВОЕ СОЕДИНЕНИЕ
	//|	(	ВЫБРАТЬ Код, МАКСИМУМ(Ссылка)
	//|		ИЗ 		Справочник.Производители 
	//|		ГДЕ НЕ ПометкаУдаления И Код В(ВЫБРАТЬ ПроизводительКод ИЗ Товары)
	//|		СГРУППИРОВАТЬ ПО Код
	//|	) Произ
	//|ПО 
	//|	Произ.Код = Тов.ПроизводительКод
	//|");
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Тов.Артикул,
	                      |	Тов.Номенклатура,
	                      |	Тов.Цена,
	                      |	Тов.Количество,
	                      |	Тов.Комментарий,
	                      |	Тов.ПроизводительНаим
	                      |ПОМЕСТИТЬ Товары
	                      |ИЗ
	                      |	&Товары КАК Тов
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Тов.Артикул,
	                      |	ЕСТЬNULL(Спр.Ссылка, Тов.Номенклатура) КАК Номенклатура,
	                      |	Тов.Цена,
	                      |	Тов.Количество,
	                      |	ИСТИНА КАК Пересчет,
	                      |	Тов.Комментарий,
	                      |	ЕСТЬNULL(Произ.Ссылка, Тов.ПроизводительНаим) КАК Производитель
	                      |ИЗ
	                      |	Товары КАК Тов
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |			Номенклатура.Артикул КАК Артикул,
	                      |			МАКСИМУМ(Номенклатура.Ссылка) КАК Ссылка
	                      |		ИЗ
	                      |			Справочник.Номенклатура КАК Номенклатура
	                      |		ГДЕ
	                      |			НЕ Номенклатура.ПометкаУдаления
	                      |			И Номенклатура.Артикул В
	                      |					(ВЫБРАТЬ
	                      |						Товары.Артикул
	                      |					ИЗ
	                      |						Товары)
	                      |		
	                      |		СГРУППИРОВАТЬ ПО
	                      |			Номенклатура.Артикул) КАК Спр
	                      |		ПО (Спр.Артикул = Тов.Артикул)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |			МАКСИМУМ(Производители.Ссылка) КАК Ссылка,
	                      |			Производители.Наименование КАК Наименование
	                      |		ИЗ
	                      |			Справочник.Производители КАК Производители
	                      |		ГДЕ
	                      |			НЕ Производители.ПометкаУдаления
	                      |			И Производители.Наименование В
	                      |					(ВЫБРАТЬ
	                      |						Товары.ПроизводительНаим
	                      |					ИЗ
	                      |						Товары)
	                      |		
	                      |		СГРУППИРОВАТЬ ПО
	                      |			Производители.Наименование) КАК Произ
	                      |		ПО Тов.ПроизводительНаим = Произ.Наименование");

	
	Запрос.УстановитьПараметр("Товары", Товары.Выгрузить());
	Возврат ПоместитьВоВременноеХранилище(Запрос.Выполнить().Выгрузить());
	
КонецФункции

&НаКлиенте
Процедура Загрузить(Команда)
	
	// Загрузим из таблицы
	
	КолСтрок = ТабличныйДокумент.ВысотаТаблицы;
	Товары.Очистить();
	
	Для НомСтр = 1 По КолСтрок Цикл 
		
		ОбработкаПрерыванияПользователя();
		Состояние("Сканируем строки", НомСтр / КолСтрок * 100, НомСтр, БиблиотекаКартинок.Эксель);
		
		НовСтрока = Товары.Добавить();
		
		НовСтрока.Артикул 			= ТабличныйДокумент.Область("R" + Строка(НомСтр) + "C" + Строка(1)).Текст;
		НовСтрока.Номенклатура 		= ТабличныйДокумент.Область("R" + Строка(НомСтр) + "C" + Строка(2)).Текст;
		
		НовСтрока.Количество 	    = ТабличныйДокумент.Область("R" + Строка(НомСтр) + "C" + Строка(3)).Текст;
		НовСтрока.Цена 		        = ТабличныйДокумент.Область("R" + Строка(НомСтр) + "C" + Строка(4)).Текст;
		НовСтрока.ПроизводительНаим = ТабличныйДокумент.Область("R" + Строка(НомСтр) + "C" + Строка(5)).Текст;
		//НовСтрока.ПроизводительКод	= ТабличныйДокумент.Область("R" + Строка(НомСтр) + "C" + Строка(5)).Текст;
		НовСтрока.Комментарий 		= ТабличныйДокумент.Область("R" + Строка(НомСтр) + "C" + Строка(6)).Текст; КонецЦикла;
	
	// Отправим на поиск товаров и потом в документ
	
	Если КолСтрок > 99 Тогда ПоказатьОповещениеПользователя("Поиск товаров в базе",,"Ищем по артикулу товары в базе", БиблиотекаКартинок.НайтиПоНомеру) КонецЕсли;
	ОповеститьОВыборе(Новый Структура("Товары, ПересчитатьЦену, ДобавитьВКонец", НайтиТоварыИПоложитьВХранилище(), Истина, Истина));
	
КонецПроцедуры
